#include <iostream>
#include <string>
using namespace std;

int main() {
    system("chcp 65001 > nul"); //อ่านภาษาไทย
    string program[2] = {"ภาคปกติ", "ภาคพิเศษ(นานาชาติ)"};
    string regularProgram[9] = {"โยธา", "ไฟฟ้า", "เครื่องกล", "อุตสาหการ", "คอมพิวเตอร์", "สิ่งแวดล้อม", "เหมืองแร่และปิโตรเลียม", "หุ่นยนต์และปัญญาประดิษฐ์", "บูรณาการ"};
    string specialProgram[7] = {"เครื่องกลเเละการบริหารโครงการวิศวกรรม", "โยธา", "อุตสาหการเเละการจัดการโลจิสติกส์", "ไฟฟ้าเเละเทคโนโลยีโครงข่ายไฟฟ้าอัจฉริยะ", "ระบบสารสนเทศเเละความปลอดภัยไซเบอร์", "บูรณาการเเละพหุวิทยาการ", "เซมิคอนดักเตอร์"};
    string* selectedArray = nullptr; //จะชี้ไปที่หลักสูตรที่เลือก
    int selectedSize = 0;
    string ans;

    //ลูปเลือกหลักสูตร
    while(true){
        cout << "\n-------------------------------" << endl;
        cout << "หลักสูตรที่เปิดสอน: " << endl;
        cout << "1. " << program[0] << endl;
        cout << "2. " << program[1] << endl;
        cout << "กรุณาเลือกหลักสูตร: ";
        getline(cin, ans);

        if(ans == "ภาคปกติ" || ans == "1"){
            selectedArray = regularProgram; //จะให้arrayชี้ไปที่หลักสูตรที่เลือก
            selectedSize = 9;
            cout << "\n>>> ภาคปกติมีสาขาดังนี้ครับ: " << endl;
            for(int i = 0; i < selectedSize; i++){
                cout << i + 1 << ". " << selectedArray[i] << endl; //พิพม์ชื่อสาขาพร้อมลำดับ
            }
            break; 
        }else if(ans == "ภาคพิเศษ(นานาชาติ)" || ans == "2"){
            selectedArray = specialProgram; //จะให้arrayชี้ไปที่หลักสูตรที่เลือก
            selectedSize = 7;
            cout << "\n>>> ภาคพิเศษ(นานาชาติ)มีสาขาดังนี้ครับ: " << endl;
            for(int i = 0; i < selectedSize; i++){
                cout << i + 1 << ". " << selectedArray[i] << endl; //พิพม์ชื่อสาขาพร้อมลำดับ
            }
            break; 
        }else{
            cout << "คุณกรอกข้อมูลไม่ถูกต้อง กรุณาเลือก 1 หรือ 2 เท่านั้น หรือหากต้องการออกจากโปรแกรม ให้พิมพ์ 'exit'" << endl; //กรณีกรอกข้อมูลไม่ตรงกับที่มีให้
            if(ans == "exit"){
                cout << "ขอบคุณที่ใช้บริการครับ!" << endl;
                return 0; //ตัดจบ
            }
        }
    }

    //ลูปเลือกสาขา
    while(true){
        cout << "\nสนใจเกี่ยวกับสาขาไหนครับ? (พิมพ์หมายเลขลำดับ หรือ ชื่อสาขา): ";
        string majorInput;
        getline (cin, majorInput);

        bool found = false;
        int selectedIndex = -1;
        bool isNumber = !majorInput.empty() && majorInput.find_first_not_of("0123456789") == string::npos; //ดูว่าสาขาที่ใส่มาไม่ว่าง และหาตัวอักษรไม่เจอเลยจะนับว่าเป็นเลข
        
        //หากเป็นเลขจะเช็คว่าตรงกับลำดับไหม
        if(isNumber){
            int num = stoi(majorInput);
            if(num >= 1 && num <= selectedSize){
                found = true;
                selectedIndex = num - 1;
            }
        }

        //หากไม่ใช่เลขจะเช็คว่าตรงกับชื่อสาขาไหม
        if(!found){
            for(int i = 0; i < selectedSize; i++){
                if(majorInput == selectedArray[i]){
                    found = true;
                    selectedIndex = i;
                    break;
                }
            }
        }

        //แสดงข้อมูลถ้าหากเจอ
        if(found){
            string majorName = selectedArray[selectedIndex];
            cout << "\n----------------------------------------" << endl;
            cout << "[ ข้อมูลอันดับที่ " << selectedIndex + 1 << ": สาขา" << majorName << " ]" << endl;
            
            //ใช้เงื่อนไขเช็คชื่อและ พิมพ์ออกมาเกี่ยวกับสาขาคร่าวๆ
            if(majorName == "โยธา"){
                if(ans == "1" || ans == "ภาคปกติ"){ //หากตอนแรกเลือกภาคปกติจะมีข้อมูลที่แตกต่างจากภาคนานาชาติ
                    cout << ">> เน้นการออกแบบและควบคุมการก่อสร้างโครงสร้างพื้นฐาน ตั้งแต่บ้าน อาคารสูง ถนน ไปจนถึงเขื่อนและสะพาน" << endl;
                    cout << ">> เรียนเกี่ยวกับ: กลศาสตร์, การออกแบบโครงสร้างเหล็กและคอนกรีต, ปฐพีกลศาสตร์, และการสำรวจ" << endl;
                    cout << ">> สายงาน: วิศวกรโครงการ, ผู้ออกแบบโครงสร้าง, ที่ปรึกษาการก่อสร้าง" << endl;
                    cout << ">> จุดเด่น: เป็นภาควิชาที่เก่าแก่และมีเครือข่ายรุ่นพี่ (Alumni) กว้างขวางที่สุดในภาคเหนือ เน้นการสร้างสิ่งที่จับต้องได้จริงและมีความคงทนถาวร" << endl;
                }else{
                    cout << ">> เน้นการออกแบบและก่อสร้างโครงสร้างพื้นฐานตามมาตรฐานสากล" << endl;
                    cout << ">> เรียนเกี่ยวกับ: วิเคราะห์โครงสร้าง, เทคโนโลยีก่อสร้างสมัยใหม่, การจัดการทรัพยากรน้ำ และภาษาอังกฤษทางวิศวกรรม" << endl;
                    cout << ">> สายงาน: วิศวกรโครงสร้าง (Structural Engineer) ในบริษัทก่อสร้างระดับโลก, วิศวกรควบคุมงานโครงการรถไฟฟ้าหรือทางด่วน, ที่ปรึกษาด้านการก่อสร้างยั่งยืน (Green Building), วิศวกรสำรวจในโครงการข้ามพรมแดน" << endl;
                    cout << ">> จุดเด่น: เตรียมความพร้อมสำหรับการไปทำงานในบริษัทข้ามชาติ หรือการศึกษาต่อในต่างประเทศด้วยการใช้ตำราและมาตรฐานสากล" << endl;
                }
            }else if(majorName == "ไฟฟ้า"){
                cout << ">> ครอบคลุมตั้งแต่ระบบไฟฟ้ากำลังที่ใช้ในเมือง ไปจนถึงระบบสื่อสารและอิเล็กทรอนิกส์ขนาดเล็ก" << endl;
                cout << ">> เรียนเกี่ยวกับ: วงจรไฟฟ้า, สนามแม่เหล็กไฟฟ้า, ระบบควบคุม, และการผลิตไฟฟ้า" << endl;
                cout << ">> สายงาน: วิศวกรไฟฟ้ากำลัง (กฟผ./กฟภ.), วิศวกรระบบสื่อสาร, วิศวกรอิเล็กทรอนิกส์" << endl;
                cout << ">> จุดเด่น: มีห้องปฏิบัติการที่ทันสมัย ครอบคลุมทั้งสาย กำลัง (ไฟบ้าน/โรงงาน) และสาย สื่อสาร/อิเล็กทรอนิกส์ เป็นหัวใจหลักของเทคโนโลยีทุกอย่างในปัจจุบัน" << endl;
            }else if(majorName == "เครื่องกล"){
                cout << ">> หัวใจของอุตสาหกรรมทุกประเภท เกี่ยวข้องกับการเคลื่อนที่ พลังงาน และการออกแบบเครื่องจักร" << endl;
                cout << ">> เรียนเกี่ยวกับ: อุณหพลศาสตร์ (Thermodynamics), กลศาสตร์ของไหล, การออกแบบเครื่องจักร, และระบบปรับอากาศ" << endl;
                cout << ">> สายงาน: วิศวกรโรงงาน, วิศวกรออกแบบยานยนต์, วิศวกรพลังงาน" << endl;
                cout << ">> จุดเด่น: เรียนรู้เรื่อง พลังงานและการเคลื่อนที่ อย่างลึกซึ้ง เป็นสาขาที่ยืดหยุ่นสูงที่สุด ไปทำงานในอุตสาหกรรมไหนก็ได้ที่มีเครื่องจักรหรือระบบทำความเย็น" << endl;
            }else if(majorName == "อุตสาหการ"){
                cout << ">> เรียนรู้วิธีการบริหารจัดการ คน เครื่องจักร และงบประมาณ ให้ทำงานร่วมกันได้อย่างมีประสิทธิภาพสูงสุด" << endl;
                cout << ">> เรียนเกี่ยวกับ: การวางแผนการผลิต, การควบคุมคุณภาพ, เศรษฐศาสตร์วิศวกรรม, และการจัดการโซ่อุปทาน" << endl;
                cout << ">> สายงาน: วิศวกรวางแผน, QA/QC, นักวิเคราะห์ระบบงานในธนาคารหรือโลจิสติกส์" << endl;
                cout << ">> จุดเด่น: เป็นนักบริหารในคราบวิศวกร เน้นการมองภาพรวมเพื่อลดต้นทุนและเพิ่มกำไร ใช้ทักษะด้านการจัดการมากกว่าการคำนวณฟิสิกส์จ๋าๆ" << endl;
            }else if(majorName == "คอมพิวเตอร์"){
                cout << ">> เน้นทั้งด้าน Hardware (ตัวเครื่อง) และ Software (โปรแกรม) รวมถึงระบบเครือข่ายและการจัดการข้อมูล" << endl;
                cout << ">> เรียนเกี่ยวกับ: การเขียนโปรแกรม, สถาปัตยกรรมคอมพิวเตอร์, ระบบปฏิบัติการ, และโครงสร้างข้อมูล" << endl;
                cout << ">> สายงาน: Software Developer, Systems Engineer, Data Engineer, Network Administrator" << endl;
                cout << ">> จุดเด่น: เน้นความเข้าใจเชิงลึกถึง โครงสร้าง ของคอมพิวเตอร์ (Hardware) ควบคู่กับการเขียนโปรแกรม (Software) เหมาะกับยุคดิจิทัลทรานส์ฟอร์เมชัน" << endl;
            }else if(majorName == "สิ่งแวดล้อม"){
                cout << ">> มุ่งเน้นการแก้ปัญหามลพิษและการจัดการทรัพยากรธรรมชาติเพื่อความยั่งยืน" << endl;
                cout << ">> เรียนเกี่ยวกับ: การบำบัดน้ำเสีย, การจัดการขยะมูลฝอย, มลพิษทางอากาศ, และการออกแบบระบบประปา" << endl;
                cout << ">> สายงาน: วิศวกรสิ่งแวดล้อมในโรงงาน, ที่ปรึกษาด้านสิ่งแวดล้อม (EIA), หน่วยงานภาครัฐ" << endl;
                cout << ">> จุดเด่น: ตอบโจทย์เทรนด์โลกเรื่อง Sustainability และ ESG เน้นการแก้ปัญหามลพิษเชิงวิศวกรรมเพื่อคุณภาพชีวิตที่ดีขึ้น" << endl;
            }else if(majorName == "เหมืองแร่และปิโตรเลียม"){
                cout << ">> เรียนเกี่ยวกับการสำรวจ สกัด และแปรรูปทรัพยากรธรณีและพลังงานจากใต้ดิน" << endl;
                cout << ">> เรียนเกี่ยวกับ: ธรณีวิศวกรรม, การทำเหมืองแบบเปิดและใต้ดิน, วิศวกรรมแหล่งกักเก็บ (ปิโตรเลียม)" << endl;
                cout << ">> สายงาน: วิศวกรเหมืองแร่, วิศวกรขุดเจาะน้ำมัน, วิศวกรฝ่ายผลิตในอุตสาหกรรมปูนซีเมนต์" << endl;
                cout << ">> จุดเด่น: สาขาเฉพาะทางที่มีผู้เชี่ยวชาญน้อยแต่ความต้องการสูง เรียนรู้การจัดการทรัพยากรใต้ดินและวัสดุศาสตร์ชั้นสูง" << endl;
            }else if(majorName == "หุ่นยนต์และปัญญาประดิษฐ์"){
                cout << ">> สาขาน้องใหม่ที่รวมเอาเครื่องกล ไฟฟ้า และคอมพิวเตอร์เข้าด้วยกัน เพื่อสร้างระบบอัตโนมัติที่ชาญฉลาด" << endl;
                cout << ">> เรียนเกี่ยวกับ: ระบบควบคุมหุ่นยนต์, Machine Learning, Computer Vision, และการออกแบบกลไก" << endl;
                cout << ">> สายงาน: วิศวกรหุ่นยนต์, AI Developer, วิศวกรระบบอัตโนมัติในโรงงาน Smart Factory" << endl;
                cout << ">> จุดเด่น: การเรียนแบบ Project-based ที่เน้นการสร้างนวัตกรรมอัตโนมัติ เป็นการรวมพลังของไฟฟ้า เครื่องกล และคอมพิวเตอร์เข้าด้วยกัน" << endl;
            }else if(majorName == "บูรณาการ"){
                cout << ">> เป็นหลักสูตรที่ยืดหยุ่น เน้นการนำองค์ความรู้หลายแขนงมาประยุกต์ใช้เพื่อตอบโจทย์อุตสาหกรรมสมัยใหม่" << endl;
                cout << ">> เรียนเกี่ยวกับ: เรียนพื้นฐานวิศวกรรมที่หลากหลาย และเลือกความเชี่ยวชาญตาม Module ที่สนใจ(เช่น การจัดการพลังงาน หรือวิศวกรรมชีวการแพทย์)" << endl;
                cout << ">> สายงาน: กว้างขวางตามสาขาที่เลือกเน้น มักทำงานในส่วนการบริหารโครงการหรือนวัตกรรมใหม่ ๆ" << endl;
                cout << ">> จุดเด่น: หลักสูตรตามใจผู้เรียน มีความยืดหยุ่นสูงสุด สามารถเลือกเรียนข้ามสายเพื่อสร้างทักษะแบบ Multi-skill ตามเทรนด์ตลาดงานที่เปลี่ยนไป" << endl;
            }else if(majorName == "เครื่องกลเเละการบริหารโครงการวิศวกรรม"){
                cout << ">> เป็นการนำพื้นฐานวิศวกรรมเครื่องกลมาบวกกับทักษะการบริหารจัดการแบบนักบริหาร" << endl;
                cout << ">> เรียนเกี่ยวกับ: นอกจากเครื่องกลหลัก (Thermodynamics, Fluid) จะเน้นเรื่องการวางแผนโครงการ, การบริหารความเสี่ยง, และเศรษฐศาสตร์สำหรับวิศวกร" << endl;
                cout << ">> สายงาน: ผู้จัดการโครงการ (Project Manager), วิศวกรซ่อมบำรุงในอุตสาหกรรมพลังงานหรือรถยนต์, ที่ปรึกษาด้านการจัดการพลังงาน, วิศวกรผู้ออกแบบระบบในบริษัทข้ามชาติ" << endl;
                cout << ">> จุดเด่น: จบไปไม่ใช่แค่ซ่อมหรือออกแบบเครื่องจักรเป็น แต่ออกแบบ แผนงาน และคุมงบประมาณโครงการใหญ่ ๆ ได้" << endl;
            }else if(majorName == "อุตสาหการเเละการจัดการโลจิสติกส์"){
                cout << ">> เน้นการจัดการระบบการผลิตและห่วงโซ่อุปทานที่เชื่อมโยงกันทั่วโลก" << endl;
                cout << ">> เรียนเกี่ยวกับ: การบริหารคลังสินค้า, ระบบขนส่ง, การวิจัยดำเนินงาน (OR), และการปรับปรุงกระบวนการแบบ Lean" << endl;
                cout << ">> สายงาน: วิศวกรโลจิสติกส์ (Logistics Engineer), นักวิเคราะห์โซ่อุปทาน (Supply Chain Analyst) ในบริษัท E-commerce หรือห้างค้าปลีกยักษ์ใหญ่, วิศวกรวางแผนการผลิตในนิคมอุตสาหกรรม" << endl;
                cout << ">> จุดเด่น: เหมาะมากกับยุค E-commerce และการนำเข้า-ส่งออก เพราะเน้นที่ ประสิทธิภาพและความรวดเร็ว" << endl;
            }else if(majorName == "ไฟฟ้าเเละเทคโนโลยีโครงข่ายไฟฟ้าอัจฉริยะ"){
                cout << ">> ยกระดับวิศวกรรมไฟฟ้าแบบเดิมเข้าสู่ยุคพลังงานสะอาดและระบบดิจิทัล" << endl;
                cout << ">> เรียนเกี่ยวกับ: พลังงานหมุนเวียน (Solar/Wind), ระบบกักเก็บพลังงาน (Battery), และการใช้ AI ควบคุมการจ่ายไฟ (Smart Grid)" << endl;
                cout << ">> สายงาน: วิศวกรระบบ Smart Grid, วิศวกรออกแบบระบบสถานีชาร์จรถยนต์ไฟฟ้า (EV), ผู้เชี่ยวชาญด้านพลังงานสะอาดในนิคมอุตสาหกรรม, วิศวกรควบคุมระบบไฟฟ้าในบริษัท Tech หรือ Data Center" << endl;
                cout << ">> จุดเด่น: เป็นสายงานที่กำลังเป็นที่ต้องการสูงมากตามเทรนด์ EV และพลังงานยั่งยืน" << endl;
            }else if(majorName == "ระบบสารสนเทศเเละความปลอดภัยไซเบอร์"){
                cout << ">> เน้นความปลอดภัยของข้อมูล ซึ่งเป็นหัวใจสำคัญของโลกดิจิทัลปัจจุบัน" << endl;
                cout << ">> เรียนเกี่ยวกับ: การป้องกันการแฮ็ก (Hacking), การวิเคราะห์ช่องโหว่ระบบ, การบริหารจัดการ Cloud และ Big Data" << endl;
                cout << ">> สายงาน: ผู้เชี่ยวชาญความปลอดภัยไซเบอร์ (Cybersecurity Analyst), นักทดสอบเจาะระบบ (Penetration Tester), ผู้ดูแลระบบความปลอดภัยในธนาคารหรือองค์กรใหญ่, ที่ปรึกษาด้านความปลอดภัยดิจิทัล" << endl;
                cout << ">> จุดเด่น: สายงานนี้มีรายได้สูงและเป็นที่ต้องการทั่วโลก เพราะบริษัทใหญ่ ๆ ต่างกลัวการโดนโจมตีทางไซเบอร์" << endl;
            }else if(majorName == "บูรณาการเเละพหุวิทยาการ"){
                cout << ">> เป็นหลักสูตรที่ให้คุณ Customize หรือเลือกเรียนตามความสนใจที่หลากหลาย" << endl;
                cout << ">> เรียนเกี่ยวกับ: ไม่ได้เจาะจงสาขาเดียว แต่จะเน้นการแก้ปัญหาที่ต้องใช้ความรู้หลายด้าน (Cross-disciplinary) เช่น หุ่นยนต์การแพทย์ หรือเทคโนโลยีด้านอาหาร" << endl;
                cout << ">> สายงาน: นักพัฒนานวัตกรรม (Innovation Developer), ผู้จัดการผลิตภัณฑ์ทางเทคโนโลยี (Tech Product Manager), ผู้ประกอบการธุรกิจเทคโนโลยี (Tech Startup), วิศวกรในอุตสาหกรรมนวัตกรรมใหม่ (New S-Curve)" << endl;
                cout << ">> จุดเด่น: มีความยืดหยุ่นสูงมาก เหมาะกับคนที่ชอบเรียนรู้สิ่งใหม่ ๆ และอยากสร้างนวัตกรรมที่ไม่อยู่ในกรอบเดิม" << endl;
            }else if(majorName == "เซมิคอนดักเตอร์"){
                cout << ">> สาขาน้องใหม่ที่ตอบโจทย์อุตสาหกรรม ชิป ซึ่งเป็นสมองของอุปกรณ์อิเล็กทรอนิกส์ทุกชนิด" << endl;
                cout << ">> เรียนเกี่ยวกับ: กระบวนการผลิตแผงวงจรขนาดจิ๋ว, วัสดุศาสตร์ชั้นสูง, และการออกแบบวงจรรวม (IC Design)" << endl;
                cout << ">> สายงาน: วิศวกรออกแบบชิป (IC Design Engineer), วิศวกรกระบวนการผลิตในโรงงานเซมิคอนดักเตอร์ (Process Engineer), นักวิจัยและพัฒนาวัสดุอิเล็กทรอนิกส์ในบริษัทชั้นนำอย่าง Intel, Samsung หรือ WD" << endl;
                cout << ">> จุดเด่น: เป็นอุตสาหกรรมยุทธศาสตร์ระดับโลกที่ขาดแคลนบุคลากรอย่างหนัก จบไปมีโอกาสทำงานในโรงงานผลิตชิปชั้นนำ" << endl;
            }

            cout << "----------------------------------------" << endl;
            cout << "มีคำถามเพิ่มเติมเกี่ยวกับสาขา " << majorName << " ไหมครับ?: ";
            string more;
            getline (cin, more);
            break; //ออกจากลูปสาขา ต้องมาทำเพิ่มเติมตรงนี้อีกเกี่ยวกับคำถามอื่นๆ
        }else{ //กรณีไม่เจอทั้งชื่อและลำดับ
            cout << "ไม่พบข้อมูลที่กรอก กรุณาลองใหม่อีกครั้ง หรือหากต้องการออกจากโปรแกรม ให้พิมพ์ 'exit'" << endl;
            if(majorInput == "exit"){
                cout << "ขอบคุณที่ใช้บริการครับ!" << endl;
                return 0; //ออกไปเลยบ้ายบ่าย
            }
        }
    }
}